dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxCan_bf.h
/** \brief Length for Ifx_CAN_ACCEN0_Bits.EN15 */
#define IFX_CAN_ACCEN0_EN15_LEN (1u)

/** \brief Mask for Ifx_CAN_ACCEN0_Bits.EN15 */
#define IFX_CAN_ACCEN0_EN15_MSK (0x1u)

/** \brief Offset for Ifx_CAN_ACCEN0_Bits.EN15 */
#define IFX_CAN_ACCEN0_EN15_OFF (15u)

/** \brief Length for Ifx_CAN_ACCEN0_Bits.EN16 */
#define IFX_CAN_ACCEN0_EN16_LEN (1u)

/** \brief Mask for Ifx_CAN_ACCEN0_Bits.EN16 */
#define IFX_CAN_ACCEN0_EN16_MSK (0x1u)

/** \brief Offset for Ifx_CAN_ACCEN0_Bits.EN16 */
#define IFX_CAN_ACCEN0_EN16_OFF (16u)

/** \brief Length for Ifx_CAN_ACCEN0_Bits.EN17 */
#define IFX_CAN_ACCEN0_EN17_LEN (1u)

/** \brief Mask for Ifx_CAN_ACCEN0_Bits.EN17 */
#define IFX_CAN_ACCEN0_EN17_MSK (0x1u)

/** \brief Offset for Ifx_CAN_ACCEN0_Bits.EN17 */
#define IFX_CAN_ACCEN0_EN17_OFF (17u)

/** \brief Length for Ifx_CAN_ACCEN0_Bits.EN18 */
#define IFX_CAN_ACCEN0_EN18_LEN (1u)

/** \brief Mask for Ifx_CAN_ACCEN0_Bits.EN18 */
#define IFX_CAN_ACCEN0_EN18_MSK (0x1u)

/** \brief Offset for Ifx_CAN_ACCEN0_Bits.EN18 */
#define IFX_CAN_ACCEN0_EN18_OFF (18u)

/** \brief Length for Ifx_CAN_ACCEN0_Bits.EN19 */
#define IFX_CAN_ACCEN0_EN19_LEN (1u)

/** \brief Mask for Ifx_CAN_ACCEN0_Bits.EN19 */
#define IFX_CAN_ACCEN0_EN19_MSK (0x1u)

/** \brief Offset for Ifx_CAN_ACCEN0_Bits.EN19 */
#define IFX_CAN_ACCEN0_EN19_OFF (19u)

/** \brief Length for Ifx_CAN_ACCEN0_Bits.EN20 */
#define IFX_CAN_ACCEN0_EN20_LEN (1u)

/** \brief Mask for Ifx_CAN_ACCEN0_Bits.EN20 */
#define IFX_CAN_ACCEN0_EN20_MSK (0x1u)

/** \brief Offset for Ifx_CAN_ACCEN0_Bits.EN20 */
#define IFX_CAN_ACCEN0_EN20_OFF (20u)

/** \brief Length for Ifx_CAN_ACCEN0_Bits.EN21 */
#define IFX_CAN_ACCEN0_EN21_LEN (1u)

/** \brief Mask for Ifx_CAN_ACCEN0_Bits.EN21 */
#define IFX_CAN_ACCEN0_EN21_MSK (0x1u)

/** \brief Offset for Ifx_CAN_ACCEN0_Bits.EN21 */
#define IFX_CAN_ACCEN0_EN21_OFF (21u)

/** \brief Length for Ifx_CAN_ACCEN0_Bits.EN22 */
#define IFX_CAN_ACCEN0_EN22_LEN (1u)

/** \brief Mask for Ifx_CAN_ACCEN0_Bits.EN22 */
#define IFX_CAN_ACCEN0_EN22_MSK (0x1u)

/** \brief Offset for Ifx_CAN_ACCEN0_Bits.EN22 */
#define IFX_CAN_ACCEN0_EN22_OFF (22u)

/** \brief Length for Ifx_CAN_ACCEN0_Bits.EN23 */
#define IFX_CAN_ACCEN0_EN23_LEN (1u)

/** \brief Mask for Ifx_CAN_ACCEN0_Bits.EN23 */
#define IFX_CAN_ACCEN0_EN23_MSK (0x1u)

/** \brief Offset for Ifx_CAN_ACCEN0_Bits.EN23 */
#define IFX_CAN_ACCEN0_EN23_OFF (23u)

/** \brief Length for Ifx_CAN_ACCEN0_Bits.EN24 */
#define IFX_CAN_ACCEN0_EN24_LEN (1u)

/** \brief Mask for Ifx_CAN_ACCEN0_Bits.EN24 */
#define IFX_CAN_ACCEN0_EN24_MSK (0x1u)

/** \brief Offset for Ifx_CAN_ACCEN0_Bits.EN24 */
#define IFX_CAN_ACCEN0_EN24_OFF (24u)

/** \brief Length for Ifx_CAN_ACCEN0_Bits.EN25 */
#define IFX_CAN_ACCEN0_EN25_LEN (1u)

/** \brief Mask for Ifx_CAN_ACCEN0_Bits.EN25 */
#define IFX_CAN_ACCEN0_EN25_MSK (0x1u)

/** \brief Offset for Ifx_CAN_ACCEN0_Bits.EN25 */
#define IFX_CAN_ACCEN0_EN25_OFF (25u)

/** \brief Length for Ifx_CAN_ACCEN0_Bits.EN26 */
#define IFX_CAN_ACCEN0_EN26_LEN (1u)

/** \brief Mask for Ifx_CAN_ACCEN0_Bits.EN26 */
#define IFX_CAN_ACCEN0_EN26_MSK (0x1u)

/** \brief Offset for Ifx_CAN_ACCEN0_Bits.EN26 */
#define IFX_CAN_ACCEN0_EN26_OFF (26u)

/** \brief Length for Ifx_CAN_ACCEN0_Bits.EN27 */
#define IFX_CAN_ACCEN0_EN27_LEN (1u)

/** \brief Mask for Ifx_CAN_ACCEN0_Bits.EN27 */
#define IFX_CAN_ACCEN0_EN27_MSK (0x1u)

/** \brief Offset for Ifx_CAN_ACCEN0_Bits.EN27 */
#define IFX_CAN_ACCEN0_EN27_OFF (27u)

/** \brief Length for Ifx_CAN_ACCEN0_Bits.EN28 */
#define IFX_CAN_ACCEN0_EN28_LEN (1u)

/** \brief Mask for Ifx_CAN_ACCEN0_Bits.EN28 */
#define IFX_CAN_ACCEN0_EN28_MSK (0x1u)

/** \brief Offset for Ifx_CAN_ACCEN0_Bits.EN28 */
#define IFX_CAN_ACCEN0_EN28_OFF (28u)

/** \brief Length for Ifx_CAN_ACCEN0_Bits.EN29 */
#define IFX_CAN_ACCEN0_EN29_LEN (1u)

/** \brief Mask for Ifx_CAN_ACCEN0_Bits.EN29 */
#define IFX_CAN_ACCEN0_EN29_MSK (0x1u)

/** \brief Offset for Ifx_CAN_ACCEN0_Bits.EN29 */
#define IFX_CAN_ACCEN0_EN29_OFF (29u)

/** \brief Length for Ifx_CAN_ACCEN0_Bits.EN30 */
#define IFX_CAN_ACCEN0_EN30_LEN (1u)

/** \brief Mask for Ifx_CAN_ACCEN0_Bits.EN30 */
#define IFX_CAN_ACCEN0_EN30_MSK (0x1u)

/** \brief Offset for Ifx_CAN_ACCEN0_Bits.EN30 */
#define IFX_CAN_ACCEN0_EN30_OFF (30u)

/** \brief Length for Ifx_CAN_ACCEN0_Bits.EN31 */
#define IFX_CAN_ACCEN0_EN31_LEN (1u)

/** \brief Mask for Ifx_CAN_ACCEN0_Bits.EN31 */
#define IFX_CAN_ACCEN0_EN31_MSK (0x1u)

/** \brief Offset for Ifx_CAN_ACCEN0_Bits.EN31 */
#define IFX_CAN_ACCEN0_EN31_OFF (31u)

/** \brief Length for Ifx_CAN_N_ACCENNODE0_Bits.EN0 */
#define IFX_CAN_N_ACCENNODE0_EN0_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ACCENNODE0_Bits.EN0 */
#define IFX_CAN_N_ACCENNODE0_EN0_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ACCENNODE0_Bits.EN0 */
#define IFX_CAN_N_ACCENNODE0_EN0_OFF (0u)

/** \brief Length for Ifx_CAN_N_ACCENNODE0_Bits.EN1 */
#define IFX_CAN_N_ACCENNODE0_EN1_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ACCENNODE0_Bits.EN1 */
#define IFX_CAN_N_ACCENNODE0_EN1_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ACCENNODE0_Bits.EN1 */
#define IFX_CAN_N_ACCENNODE0_EN1_OFF (1u)

/** \brief Length for Ifx_CAN_N_ACCENNODE0_Bits.EN2 */
#define IFX_CAN_N_ACCENNODE0_EN2_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ACCENNODE0_Bits.EN2 */
#define IFX_CAN_N_ACCENNODE0_EN2_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ACCENNODE0_Bits.EN2 */
#define IFX_CAN_N_ACCENNODE0_EN2_OFF (2u)

/** \brief Length for Ifx_CAN_N_ACCENNODE0_Bits.EN3 */
#define IFX_CAN_N_ACCENNODE0_EN3_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ACCENNODE0_Bits.EN3 */
#define IFX_CAN_N_ACCENNODE0_EN3_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ACCENNODE0_Bits.EN3 */
#define IFX_CAN_N_ACCENNODE0_EN3_OFF (3u)

/** \brief Length for Ifx_CAN_N_ACCENNODE0_Bits.EN4 */
#define IFX_CAN_N_ACCENNODE0_EN4_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ACCENNODE0_Bits.EN4 */
#define IFX_CAN_N_ACCENNODE0_EN4_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ACCENNODE0_Bits.EN4 */
#define IFX_CAN_N_ACCENNODE0_EN4_OFF (4u)

/** \brief Length for Ifx_CAN_N_ACCENNODE0_Bits.EN5 */
#define IFX_CAN_N_ACCENNODE0_EN5_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ACCENNODE0_Bits.EN5 */
#define IFX_CAN_N_ACCENNODE0_EN5_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ACCENNODE0_Bits.EN5 */
#define IFX_CAN_N_ACCENNODE0_EN5_OFF (5u)

/** \brief Length for Ifx_CAN_N_ACCENNODE0_Bits.EN6 */
#define IFX_CAN_N_ACCENNODE0_EN6_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ACCENNODE0_Bits.EN6 */
#define IFX_CAN_N_ACCENNODE0_EN6_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ACCENNODE0_Bits.EN6 */
#define IFX_CAN_N_ACCENNODE0_EN6_OFF (6u)

