dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxCan_bf.h
/** \brief Offset for Ifx_CAN_N_TX_EFS_Bits.EFPI */
#define IFX_CAN_N_TX_EFS_EFPI_OFF (16u)

/** \brief Length for Ifx_CAN_N_TX_EFS_Bits.EFF */
#define IFX_CAN_N_TX_EFS_EFF_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_EFS_Bits.EFF */
#define IFX_CAN_N_TX_EFS_EFF_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_EFS_Bits.EFF */
#define IFX_CAN_N_TX_EFS_EFF_OFF (24u)

/** \brief Length for Ifx_CAN_N_TX_EFS_Bits.TEFL */
#define IFX_CAN_N_TX_EFS_TEFL_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_EFS_Bits.TEFL */
#define IFX_CAN_N_TX_EFS_TEFL_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_EFS_Bits.TEFL */
#define IFX_CAN_N_TX_EFS_TEFL_OFF (25u)

/** \brief Length for Ifx_CAN_N_TX_EFA_Bits.EFAI */
#define IFX_CAN_N_TX_EFA_EFAI_LEN (5u)

/** \brief Mask for Ifx_CAN_N_TX_EFA_Bits.EFAI */
#define IFX_CAN_N_TX_EFA_EFAI_MSK (0x1fu)

/** \brief Offset for Ifx_CAN_N_TX_EFA_Bits.EFAI */
#define IFX_CAN_N_TX_EFA_EFAI_OFF (0u)

/** \brief Length for Ifx_CAN_STDMSG_S0_Bits.SFID2 */
#define IFX_CAN_STDMSG_S0_SFID2_LEN (11u)

/** \brief Mask for Ifx_CAN_STDMSG_S0_Bits.SFID2 */
#define IFX_CAN_STDMSG_S0_SFID2_MSK (0x7ffu)

/** \brief Offset for Ifx_CAN_STDMSG_S0_Bits.SFID2 */
#define IFX_CAN_STDMSG_S0_SFID2_OFF (0u)

/** \brief Length for Ifx_CAN_STDMSG_S0_Bits.SFID1 */
#define IFX_CAN_STDMSG_S0_SFID1_LEN (11u)

/** \brief Mask for Ifx_CAN_STDMSG_S0_Bits.SFID1 */
#define IFX_CAN_STDMSG_S0_SFID1_MSK (0x7ffu)

/** \brief Offset for Ifx_CAN_STDMSG_S0_Bits.SFID1 */
#define IFX_CAN_STDMSG_S0_SFID1_OFF (16u)

/** \brief Length for Ifx_CAN_STDMSG_S0_Bits.SFEC */
#define IFX_CAN_STDMSG_S0_SFEC_LEN (3u)

/** \brief Mask for Ifx_CAN_STDMSG_S0_Bits.SFEC */
#define IFX_CAN_STDMSG_S0_SFEC_MSK (0x7u)

/** \brief Offset for Ifx_CAN_STDMSG_S0_Bits.SFEC */
#define IFX_CAN_STDMSG_S0_SFEC_OFF (27u)

/** \brief Length for Ifx_CAN_STDMSG_S0_Bits.SFT */
#define IFX_CAN_STDMSG_S0_SFT_LEN (2u)

/** \brief Mask for Ifx_CAN_STDMSG_S0_Bits.SFT */
#define IFX_CAN_STDMSG_S0_SFT_MSK (0x3u)

/** \brief Offset for Ifx_CAN_STDMSG_S0_Bits.SFT */
#define IFX_CAN_STDMSG_S0_SFT_OFF (30u)

/** \brief Length for Ifx_CAN_EXTMSG_F0_Bits.EFID1 */
#define IFX_CAN_EXTMSG_F0_EFID1_LEN (29u)

/** \brief Mask for Ifx_CAN_EXTMSG_F0_Bits.EFID1 */
#define IFX_CAN_EXTMSG_F0_EFID1_MSK (0x1fffffffu)

/** \brief Offset for Ifx_CAN_EXTMSG_F0_Bits.EFID1 */
#define IFX_CAN_EXTMSG_F0_EFID1_OFF (0u)

/** \brief Length for Ifx_CAN_EXTMSG_F0_Bits.EFEC */
#define IFX_CAN_EXTMSG_F0_EFEC_LEN (3u)

/** \brief Mask for Ifx_CAN_EXTMSG_F0_Bits.EFEC */
#define IFX_CAN_EXTMSG_F0_EFEC_MSK (0x7u)

/** \brief Offset for Ifx_CAN_EXTMSG_F0_Bits.EFEC */
#define IFX_CAN_EXTMSG_F0_EFEC_OFF (29u)

/** \brief Length for Ifx_CAN_EXTMSG_F1_Bits.EFID2 */
#define IFX_CAN_EXTMSG_F1_EFID2_LEN (29u)

/** \brief Mask for Ifx_CAN_EXTMSG_F1_Bits.EFID2 */
#define IFX_CAN_EXTMSG_F1_EFID2_MSK (0x1fffffffu)

/** \brief Offset for Ifx_CAN_EXTMSG_F1_Bits.EFID2 */
#define IFX_CAN_EXTMSG_F1_EFID2_OFF (0u)

/** \brief Length for Ifx_CAN_EXTMSG_F1_Bits.EFT */
#define IFX_CAN_EXTMSG_F1_EFT_LEN (2u)

/** \brief Mask for Ifx_CAN_EXTMSG_F1_Bits.EFT */
#define IFX_CAN_EXTMSG_F1_EFT_MSK (0x3u)

/** \brief Offset for Ifx_CAN_EXTMSG_F1_Bits.EFT */
#define IFX_CAN_EXTMSG_F1_EFT_OFF (30u)

/** \brief Length for Ifx_CAN_R0_Bits.ID */
#define IFX_CAN_R0_ID_LEN (29u)

/** \brief Mask for Ifx_CAN_R0_Bits.ID */
#define IFX_CAN_R0_ID_MSK (0x1fffffffu)

/** \brief Offset for Ifx_CAN_R0_Bits.ID */
#define IFX_CAN_R0_ID_OFF (0u)

/** \brief Length for Ifx_CAN_R0_Bits.RTR */
#define IFX_CAN_R0_RTR_LEN (1u)

/** \brief Mask for Ifx_CAN_R0_Bits.RTR */
#define IFX_CAN_R0_RTR_MSK (0x1u)

/** \brief Offset for Ifx_CAN_R0_Bits.RTR */
#define IFX_CAN_R0_RTR_OFF (29u)

/** \brief Length for Ifx_CAN_R0_Bits.XTD */
#define IFX_CAN_R0_XTD_LEN (1u)

/** \brief Mask for Ifx_CAN_R0_Bits.XTD */
#define IFX_CAN_R0_XTD_MSK (0x1u)

/** \brief Offset for Ifx_CAN_R0_Bits.XTD */
#define IFX_CAN_R0_XTD_OFF (30u)

/** \brief Length for Ifx_CAN_R0_Bits.ESI */
#define IFX_CAN_R0_ESI_LEN (1u)

/** \brief Mask for Ifx_CAN_R0_Bits.ESI */
#define IFX_CAN_R0_ESI_MSK (0x1u)

/** \brief Offset for Ifx_CAN_R0_Bits.ESI */
#define IFX_CAN_R0_ESI_OFF (31u)

/** \brief Length for Ifx_CAN_R1_Bits.RXTS */
#define IFX_CAN_R1_RXTS_LEN (16u)

/** \brief Mask for Ifx_CAN_R1_Bits.RXTS */
#define IFX_CAN_R1_RXTS_MSK (0xffffu)

/** \brief Offset for Ifx_CAN_R1_Bits.RXTS */
#define IFX_CAN_R1_RXTS_OFF (0u)

/** \brief Length for Ifx_CAN_R1_Bits.DLC */
#define IFX_CAN_R1_DLC_LEN (4u)

/** \brief Mask for Ifx_CAN_R1_Bits.DLC */
#define IFX_CAN_R1_DLC_MSK (0xfu)

/** \brief Offset for Ifx_CAN_R1_Bits.DLC */
#define IFX_CAN_R1_DLC_OFF (16u)

/** \brief Length for Ifx_CAN_R1_Bits.BRS */
#define IFX_CAN_R1_BRS_LEN (1u)

/** \brief Mask for Ifx_CAN_R1_Bits.BRS */
#define IFX_CAN_R1_BRS_MSK (0x1u)

/** \brief Offset for Ifx_CAN_R1_Bits.BRS */
#define IFX_CAN_R1_BRS_OFF (20u)

/** \brief Length for Ifx_CAN_R1_Bits.FDF */
#define IFX_CAN_R1_FDF_LEN (1u)

/** \brief Mask for Ifx_CAN_R1_Bits.FDF */
#define IFX_CAN_R1_FDF_MSK (0x1u)

/** \brief Offset for Ifx_CAN_R1_Bits.FDF */
#define IFX_CAN_R1_FDF_OFF (21u)

/** \brief Length for Ifx_CAN_R1_Bits.FIDX */
#define IFX_CAN_R1_FIDX_LEN (7u)

/** \brief Mask for Ifx_CAN_R1_Bits.FIDX */
#define IFX_CAN_R1_FIDX_MSK (0x7fu)

/** \brief Offset for Ifx_CAN_R1_Bits.FIDX */
#define IFX_CAN_R1_FIDX_OFF (24u)

/** \brief Length for Ifx_CAN_R1_Bits.ANMF */
#define IFX_CAN_R1_ANMF_LEN (1u)

/** \brief Mask for Ifx_CAN_R1_Bits.ANMF */
#define IFX_CAN_R1_ANMF_MSK (0x1u)

/** \brief Offset for Ifx_CAN_R1_Bits.ANMF */
#define IFX_CAN_R1_ANMF_OFF (31u)

/** \brief Length for Ifx_CAN_DB_Bits.DB */
#define IFX_CAN_DB_DB_LEN (8u)

/** \brief Mask for Ifx_CAN_DB_Bits.DB */
#define IFX_CAN_DB_DB_MSK (0xffu)

/** \brief Offset for Ifx_CAN_DB_Bits.DB */
#define IFX_CAN_DB_DB_OFF (0u)

/** \brief Length for Ifx_CAN_TXEVENT_E0_Bits.ID */
#define IFX_CAN_TXEVENT_E0_ID_LEN (29u)

/** \brief Mask for Ifx_CAN_TXEVENT_E0_Bits.ID */
#define IFX_CAN_TXEVENT_E0_ID_MSK (0x1fffffffu)

/** \brief Offset for Ifx_CAN_TXEVENT_E0_Bits.ID */
#define IFX_CAN_TXEVENT_E0_ID_OFF (0u)

/** \brief Length for Ifx_CAN_TXEVENT_E0_Bits.RTR */
#define IFX_CAN_TXEVENT_E0_RTR_LEN (1u)

/** \brief Mask for Ifx_CAN_TXEVENT_E0_Bits.RTR */
#define IFX_CAN_TXEVENT_E0_RTR_MSK (0x1u)

/** \brief Offset for Ifx_CAN_TXEVENT_E0_Bits.RTR */
#define IFX_CAN_TXEVENT_E0_RTR_OFF (29u)

